Revit 2026 API

# DoubleClickOptionsSetAction Method

---

Changes the double-click action associated with a specified target.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
```
```vb
Public Sub SetAction (
	target As DoubleClickTarget,
	action As DoubleClickAction
)
```
```cpp
public:
void SetAction(
	DoubleClickTarget target,
	DoubleClickAction action
)
```
```fsharp
member SetAction :
        target : DoubleClickTarget *
        action : DoubleClickAction -> unit
```

#### Parameters

target DoubleClickTarget
     The double-click target whose action will be changed.
action DoubleClickAction
     The action to assign to the target.

| Exception | Condition |
| --- | --- |
| ArgumentException | The specified action is not valid for the target element. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

This change will be stored in the user's profile and will affect future sessions of Revit in addition to the current session.

#### Reference

DoubleClickOptions Class

Autodesk.Revit.UI Namespace